classes/subclasses/psychic_sorcerer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-08 Fri 13:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Psychic Sorcerer</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../static/stylesheets/subclass-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Psychic Sorcerer</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf642c23">1. Sorcerer Traits</a></li>
<li><a href="#orgdfbd51d">2. Level 1 Sorceries</a></li>
<li><a href="#org4a00d10">3. Level 2 (5+) Sorceries</a></li>
<li><a href="#org5aa77c1">4. Level 3 (11+) Sorceries</a></li>
<li><a href="#orgfefaa96">5. Level 4 (15+) Sorceries</a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
[<a href="../../dnd.html#ID-7d419730-2064-41f9-80ee-f24ed9b01ac7">Main Menu</a>] [<a href="../classes.html#ID-69ef1740-156a-4e42-9493-49ec80a4ac26">Classes</a>] [<a href="../sorcerer.html#ID-f2323133-e17d-4cff-86db-415b72e6d42e">Sorcerer</a>]
</p>
</div>
<hr />
<p>
Something in your mind has unhinged, and in an absolute fluke this has unlocked a hidden magic that lies within the minds and hearts of all beings.
</p>

<div id="outline-container-orgf642c23" class="outline-2">
<h2 id="orgf642c23"><span class="section-number-2">1.</span> Sorcerer Traits</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><i>Gift of Gab</i>: For one reason or another, you&rsquo;re a enthralling speaker. Your persuasion attempts have advantage</li>
<li><i>Schizoid</i>:</li>
</ul>
</div>
</div>
<div id="outline-container-orgdfbd51d" class="outline-2">
<h2 id="orgdfbd51d"><span class="section-number-2">2.</span> Level 1 Sorceries</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><span class="underline"><b>Migraine</b></span>: Roll to hit. On hit, give a target a headache for three turns. Deal 1d8 madness damage on the first turn, 1d6 psychic damage, and 1d4 psychic damage.</li>
<li><span class="underline"><b>Cursed Knowledge</b></span>: Allow a party member to glimpse the insanity. Give this member +4 insight for the whole turn.</li>
<li><span class="underline"><b>Discordant Whisper</b></span>: You whisper a discordant melody that only one creature of your choice within range can hear, wracking it with terrible pain. The target must make a Wisdom saving throw. On a failed save, it takes 3d6 psychic damage and must immediately use its reaction, if available, to move as far as its speed allows away from you. The creature doesn’t move into obviously dangerous ground, such as a fire or a pit. On a successful save, the target takes half as much damage and doesn’t have to move away. A deafened creature automatically succeeds on the save.</li>
</ul>
</div>
</div>
<div id="outline-container-org4a00d10" class="outline-2">
<h2 id="org4a00d10"><span class="section-number-2">3.</span> Level 2 (5+) Sorceries</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><span class="underline"><b>Jedi Mind Trick</b></span>: You know the rules. This automatically succeeds on every creature with less than 13 INT. Creatures at or above 13 INT must roll a INT saving throw. <i>The extent of this ability is up to DM discretion</i></li>
<li><span class="underline"><b>Bad Memory</b></span>: Force a target to make a WIS saving throw. On fail, they take 1d8 madness damage and attempt to run away and cry. If they cannot run away (due to stun, root, etc), they take an additional 2d8 madness damage</li>
<li><span class="underline"><b>Confuse</b></span>: Force a target to make a WIS saving throw. On fail, their next attack is against a random target in combat and the attack does half damage.</li>
</ul>
</div>
</div>
<div id="outline-container-org5aa77c1" class="outline-2">
<h2 id="org5aa77c1"><span class="section-number-2">4.</span> Level 3 (11+) Sorceries</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><span class="underline"><b>Mind Reader</b></span>: Twice per long rest, discern the exact intentions of a creature as well as one additional fact about them. This ability can be used only when engaged in conversation with the subject.</li>
<li><span class="underline"><b>Delirium</b></span>: Once per combat, force a target to make a CON saving throw. On failure, the target attacks one member of their party (or themselves if alone), run away, and suffer the effects of madness for a turn.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfefaa96" class="outline-2">
<h2 id="orgfefaa96"><span class="section-number-2">5.</span> Level 4 (15+) Sorceries</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><span class="underline"><b>Mind Control</b></span>: Force any creature but one of the gods to make a WIS, CON, and INT saving throw. The extent to which you mind control this person depends on how many of the saving throws they succeed on. From then on, the creature will do you bidding (<i>with some DM intervention</i>). Gain one charge every 2 long rests.</li>
<li><span class="underline"><b>Mass Hallucination</b></span>: Change one facet of history forever. The practical outcome of the event will remain the same, but everyone will remember the event differently. How different will depend on how you&rsquo;d like to change the event.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-17 Mon 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-09-08 Fri 13:57</p>
</div>
</body>
</html>